app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        recipes = Recipe.all

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def create
        user = User.find(session[:user_id])