app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def show
        user = User.find(session[:user_id])

INSERT INTO "users" ("name", "user_name", "email", "password_digest", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def find_user
        User.find(params[:id])